//
//  XLAllWordOfType.m
//  WhoIsUndercover
//
//  Created by God、long on 14-6-28.
//  Copyright (c) 2014年 __许龙__. All rights reserved.
//

#import "XLAllWordOfType.h"
#import "XLWordManager.h"
#import "XLWords.h"

@implementation XLAllWordOfType

/*
+ (void)creattableNameOfWorldCup
{
    
    NSMutableArray *civilianArray = [[NSMutableArray alloc]initWithObjects:@"世界杯",
                                     @"外围传中",
                                     @"足球先生",
                                     @"抢断",
                                     @"球迷",
                                     @"护腿板",
                                     @"带球过人",
                                     @"实况足球",
                                     @"阿根廷",
                                     @"界外球",
                                     @"冷板凳",
                                     @"恒大",
                                     @"俱乐部",
                                     @"黑马",
                                     @"绝杀",
                                     @"揭幕战",
                                     @"人海",
                                     @"中场",
                                     @"守门员",
                                     @"犯规",
                                     @"远射",
                                     @"防守反击",
                                     @"下课",
                                     @"角球",
                                     @"黄牌",
                                     @"毽球",
                                     @"手球",
                                     @"意甲",
                                     @"裁判员",
                                     @"二过一",
                                     @"禁区",
                                     @"长传",
                                     @"球票",
                                     @"幸运星",
                                     @"后卫",
                                     @"倒钩球",
                                     @"马拉多纳",
                                     @"AC米兰",
                                     @"球门",
                                     @"点球",
                                     nil];
    
    NSMutableArray *undercoverArray = [[NSMutableArray alloc]initWithObjects:@"欧洲杯",
                                       @"下底传中",
                                       @"最佳球员",
                                       @"铲球",
                                       @"拉拉队",
                                       @"护膝",
                                       @"合理冲撞",
                                       @"FIFA足球",
                                       @"巴西",
                                       @"角球",
                                       @"替补",
                                       @"国安",
                                       @"国家队",
                                       @"冷门",
                                       @"翻盘",
                                       @"开幕式",
                                       @"人墙",
                                       @"前锋",
                                       @"守卫",
                                       @"越位",
                                       @"吊射",
                                       @"全攻全守",
                                       @"退役",
                                       @"点球",
                                       @"红牌",
                                       @"蹴鞠",
                                       @"头球",
                                       @"德甲",
                                       @"巡边员",
                                       @"人球分过",
                                       @"边线",
                                       @"直塞",
                                       @"球衣",
                                       @"吉祥物",
                                       @"后腰",
                                       @"香蕉球",
                                       @"贝利",
                                       @"国际米兰",
                                       @"球网",
                                       @"任意球",
                                       nil];
    XLWordManager *manager = [XLWordManager sharedInstance];
    manager.type = tableNameOfWorldCup;
    
    
    
    for (NSInteger i = 0; i < civilianArray.count; i++) {
        
        NSString *civilian = [civilianArray objectAtIndex:i];
        NSString *undercover = [undercoverArray objectAtIndex:i];
        XLWords *word = [XLWords wordWithNumber:i wordOfCivilian:civilian wordOfUndercover:undercover];
        
        [manager insertWordsItem:word];
    }
    
    
    
    
}

+ (void)creatTableNameOfwordOfFriend
{
    NSMutableArray *civilianArray = [[NSMutableArray alloc]initWithObjects:
      @"手机膜",@"火锅",@"铠甲",@"XBox",@"指甲油", @"游艇",@"黑猫警长",@"演员",@"街舞",@"僵尸",
      @"选美冠军",@"班主任",@"节操",@"古力娜扎",@"装纯", @"塑身",@"神仙",@"恍然大悟",@"图片",@"香港",
      @"暂停",@"WORD",@"魔鬼",@"正方形",@"平底鞋", @"弱智",@"绿箭",@"找你妹",@"基佬",@"手提包",
      @"科比",@"精神病",@"模仿",@"激情",@"商人", @"放屁",@"美容",@"酷我音乐",@"董事长",@"方片",
      @"奇葩",@"双色球",@"苦思冥想",@"湖南卫视",@"貂蝉", @"水煮鱼",@"防弹衣",@"竹子",@"难民",@"愤怒",
      @"牙科医生",@"任意门",@"MP4",@"桌球",@"鸭脖", @"一言不发",@"举案齐眉",@"打鼓",@"苹果",@"政党",
      @"面条",@"小笼包",@"发票",@"专家",@"非主流", @"平壤",@"冥思",@"间谍",@"宝石",@"白痴",
        @"汪涵",@"徘徊",@"幽灵",@"新郎",@"新年快乐", @"望远镜",@"好玩",@"罗贯中",@"王语嫣",@"哇塞",
        @"交通部",@"基友",@"刘亦菲",@"迪奥",@"轿车", @"经理",@"麦霸",@"壁纸",@"凤凰",@"纯净水",
        @"篮球鞋",@"收据",@"乌龟",@"朋友",@"会员", @"泡泡糖",@"逆袭",@"甜心",@"土豆网",@"奖金",
        @"工商银行",@"尿道",@"油漆",@"出纳",@"道观", @"LED",@"眼睛",@"翔",@"鳄鱼",@"牵手",
        @"擒拿术",@"奸细",@"洗面奶",@"姚明",@"摇椅",@"狄仁杰",@"手机",@"咖啡",@"海角",@"911",
      @"影后",@"比基尼",@"一面之缘",@"客机",@"自杀", @"线人",@"宅女",@"夫人",@"宙斯",@"大舅妈",
      @"Adidas",@"杠铃",@"托福",@"青春痘",@"王老吉", @"保安",@"吃醋",@"便当",@"收据",@"含笑半步癫",
      @"眉毛",@"丝瓜",@"胖子",@"平底鞋",@"凤姐", @"周杰伦",@"视频",@"失恋",@"冷艳",@"横死街头",
      @"火影",@"本拉登",@"客机",@"腋毛",@"情人节",@"朱雀",@"监视器",@"信乐团",@"排球场",@"腾讯QQ",
        @"匹诺曹",@"银行",@"广岛",@"复制",@"沙县小吃", @"奶昔",@"红颜知己",@"脸盆",@"药片",@"乌拉圭",
        @"年糕",@"汉奸",@"猴子",@"紫菜",@"海鸥",@"地主",@"伏特加",@"蜜月",@"大张伟",@"空前绝后",
      @"卡巴斯基",@"入口",@"草花",@"胡海泉",@"麻花", @"醉酒驾车",@"和尚",@"接吻",@"惊悚片",@"抱枕",
      @"烧烤",@"侏儒",@"金正恩",@"足不出户",@"鼠标", @"诸葛亮",nil];
    
    
    
    
    
    
    
    NSMutableArray *undercoverArray = [[NSMutableArray alloc]initWithObjects:
     @"手机壳",@"烧烤",@"盾牌",@"Wii",@"美甲师", @"游轮",@"包公",@"歌手",@"跳舞",@"吸血鬼",
      @"世界小姐",@"辅导员",@"情操",@"佟丽娅",@"装逼", @"减肥",@"魔鬼",@"茅塞顿开",@"视频",@"澳门",
      @"静止",@"PPT",@"天使",@"菱形",@"高跟鞋", @"幼稚",@"益达",@"连连看",@"直男",@"挎包",
      @"乔丹",@"神经病",@"抄袭",@"基情",@"老板", @"打嗝",@"美甲",@"酷狗音乐",@"总经理",@"红桃",
      @"屌丝",@"大乐透",@"绞尽脑汁",@"CCTV",@"王昭君", @"酸菜鱼",@"盔甲",@"甘蔗",@"屌丝",@"生气",
      @"口腔医生",@"时光机",@"MP3",@"乒乓球",@"鸡爪", @"言多必失",@"相濡以沫",@"敲锣",@"芒果",@"宗教",
       @"米粉",@"灌汤包",@"支票",@"教授",@"杀马特", @"首尔",@"沉思",@"黑客",@"珍珠",@"傻子",
      @"何炅",@"等待",@"僵尸",@"新娘",@"圣诞快乐", @"瞄准镜",@"可笑",@"施耐庵",@"小龙女",@"我靠",
      @"铁道部",@"损友",@"伊能静",@"香奈儿",@"卡车", @"老板",@"K歌之王",@"贴画",@"孔雀",@"矿泉水",
      @"足球鞋",@"发票",@"甲鱼",@"同学",@"成员", @"口香糖",@"逆天",@"宝贝",@"优酷网",@"福利",
      @"建设银行",@"水管",@"涂料",@"会计",@"寺庙", @"LCD",@"放大镜",@"屎",@"鲨鱼",@"握手",
        @"防狼术",@"间谍",@"爽肤水",@"林书豪",@"摇篮", @"包青天",@"相机",@"可可",@"天涯",@"110",
            @"影帝",@"丁字裤",@"萍水相逢",@"战斗机",@"自残", @"卧底",@"宅男",@"太太",@"阿瑞斯",@"大姨妈",
            @"Nike",@"哑铃",@"雅思",@"美人痣",@"加多宝",@"警察",@"嫉妒",@"快餐",@"发票",@"一日丧命散",
            @"胡须",@"黄瓜",@"吃货",@"高跟鞋",@"犀利哥", @"林俊杰",@"图片",@"离婚",@"高傲",@"死于非命",
            @"雷影",@"塔利班",@"战斗机",@"胸毛",@"光棍节", @"凤凰",@"摄像头",@"五月天",@"篮球场",@"YY语音",
            @"小红帽",@"钱柜",@"长崎",@"剪切",@"兰州拉面", @"奶茶",@"蓝颜知己",@"脚盆",@"胶囊",@"巴拉圭",
            @"寿司",@"卧底",@"拂拂",@"海苔",@"海燕",@"房东",@"威士忌",@"新婚",@"陈志朋",@"断子绝孙",
            @"金山毒霸",@"出口",@"黑桃",@"陈羽凡",@"油条", @"酒后驾车",@"光头",@"初吻",@"恐怖片",@"枕头",
            @"夜宵",@"矮人",@"金正日",@"闭门思过",@"键盘",@"周瑜",nil];
    
    XLWordManager *manager = [XLWordManager sharedInstance];
    manager.type = tableNameOfFriend;
    
    
    
    for (NSInteger i = 0; i < civilianArray.count; i++) {
        
        NSString *civilian = [civilianArray objectAtIndex:i];
        NSString *undercover = [undercoverArray objectAtIndex:i];
        XLWords *word = [XLWords wordWithNumber:i wordOfCivilian:civilian wordOfUndercover:undercover];
        
        [manager insertWordsItem:word];
    }

}

+ (void)creatTableNameOfwordOfSchoolyard
{
    NSMutableArray *civilianArray = [[NSMutableArray alloc]initWithObjects:
                                     @"脚踝" ,@"麻辣烫" ,@"防弹衣" ,@"宵夜" ,@"作家" ,@"放屁" ,@"凯旋门" ,@"高考" ,@"矮人" ,@"紫菜" ,
                                     @"奶茶" ,@"韩寒" ,@"生气" ,@"毕业" ,@"班主任" ,@"过山车" ,@"土豆粉" ,@"小笼包" ,@"泡泡糖" ,@"酸菜鱼" ,
                                     @"男朋友" ,@"口香糖" ,@"蝙蝠侠" ,@"图书馆" ,@"公交" ,@"剩女" ,@"洗衣粉" ,@"鱼香肉丝" ,@"奖牌" ,@"作文" ,
                                     @"抱枕" ,@"状元" ,@"饺子" ,@"高跟鞋" ,@"端午节" ,@"小矮人" ,@"蜘蛛侠" ,@"金庸" ,@"海豚" ,@"森马" ,
                                     @"唇膏" ,@"烤肉" ,@"纸巾" ,@"白菜" ,@"芥末" ,@"话剧" ,@"琵琶" ,@"神话" ,@"捕快" ,@"零花钱" ,
                                     @"扩音器" ,@"洗发水" ,@"自行车" ,@"福尔摩斯" ,@"美剧" ,@"流星花园" ,@"面包" ,@"同学" ,@"老佛爷" ,@"情人节" ,
                                     @"隐形眼镜" ,@"麻花" ,@"龙凤胎" ,@"魔法师" ,@"鲜橙多" ,@"豆浆" ,@"何炅" ,@"若曦" ,@"四爷" ,@"玫瑰花" ,
                                     @"操场" ,@"校花" ,@"胖子" ,@"眉毛" ,@"谢娜" ,@"水盆" ,@"香港" ,@"橙子" ,@"牛肉干" ,@"包青天" ,
                                     @"甄子丹" ,@"铁观音" ,@"十面埋伏" ,@"神雕侠侣" ,@"保镖" ,@"粉条" ,@"牛头" ,@"皇冠" ,@"蟾蜍" ,@"晴天霹雳" ,
                                     @"皮蛋豆腐" ,@"出类拔萃" ,@"宋小宝" ,@"金丝猴" ,@"天天向上" ,@"勇往直前" ,@"美人心计" ,@"鼠目寸光" ,@"语无伦次" ,@"刘诗诗" ,
                                     @"狼人" ,@"济公" ,@"花木兰" ,@"首尔" ,@"龙争虎斗" ,@"窗帘" ,@"狮子" ,@"西红柿" ,@"东方不败" ,@"中药" ,
                                     @"牛仔裤" ,@"钢笔" ,@"太阳" ,@"风衣" ,@"安卓" ,@"沉鱼落雁" ,@"直升飞机" ,@"美丽" ,@"推土机" ,@"新华字典" ,
                                     @"小红帽" ,@"恋人" ,@"日光" ,@"猩猩" ,nil];
    
    
    NSMutableArray *undercoverArray = [[NSMutableArray alloc]initWithObjects:
                                       @"膝盖" ,@"火锅" ,@"盔甲" ,@"烧烤" ,@"编剧" ,@"打嗝" ,@"埃菲尔铁塔" ,@"中考" ,@"侏儒" ,@"海苔" ,
                                       @"奶昔" ,@"郭敬明" ,@"愤怒" ,@"放假" ,@"辅导员" ,@"碰碰车" ,@"酸辣粉" ,@"灌汤包" ,@"棒棒糖" ,@"水煮鱼" ,
                                       @"前男友" ,@"木糖醇" ,@"蜘蛛侠" ,@"图书店" ,@"地铁" ,@"御姐" ,@"皂角粉" ,@"宫保鸡丁" ,@"金牌" ,@"论文" ,
                                       @"枕头" ,@"冠军" ,@"包子" ,@"增高鞋" ,@"中秋节" ,@"葫芦娃" ,@"蜘蛛精" ,@"古龙" ,@"海狮" ,@"以纯" ,
                                       @"口红" ,@"涮肉" ,@"手帕" ,@"生菜" ,@"辣椒" ,@"小品" ,@"吉他" ,@"童话" ,@"警察" ,@"生活费" ,
                                       @"麦克风" ,@"沐浴露" ,@"电动车" ,@"侦探柯南" ,@"韩剧" ,@"花样男子" ,@"蛋糕" ,@"同桌" ,@"老天爷" ,@"光棍节" ,
                                       @"近视眼镜" ,@"油条" ,@"双胞胎" ,@"魔术师" ,@"果粒多" ,@"牛奶" ,@"张杰" ,@"晴川" ,@"八爷" ,@"月季花" ,
                                       @"礼堂" ,@"美女" ,@"肥肉" ,@"胡须" ,@"李湘" ,@"水桶" ,@"台湾" ,@"橘子" ,@"猪肉脯" ,@"狄仁杰" ,
                                       @"李连杰" ,@"碧螺春" ,@"四面楚歌" ,@"天龙八部" ,@"保安" ,@"粉丝" ,@"马面" ,@"后冠" ,@"青蛙" ,@"万里无云" ,
                                       @"麻婆豆腐" ,@"鹤立鸡群" ,@"小沈阳" ,@"大白兔" ,@"非诚勿扰" ,@"全力以赴" ,@"倾世皇妃" ,@"井底之蛙" ,@"语意不清" ,@"吴奇隆" ,
                                       @"吸血鬼" ,@"法海" ,@"祝英台" ,@"东京" ,@"龙腾虎跃" ,@"床单" ,@"老虎" ,@"番茄" ,@"天山童姥" ,@"咖啡" ,
                                       @"打底裤" ,@"铅笔" ,@"月亮" ,@"毛衣" ,@"苹果" ,@"闭月羞花" ,@"喷气飞机" ,@"魅力" ,@"挖土机" ,@"英汉字典" ,
                                       @"绿帽子" ,@"情人" ,@"灯光" ,@"猴子",nil];
    
    
    
    
    XLWordManager *manager = [XLWordManager sharedInstance];
    manager.type = tableNameOfSchoolyard;
    
    for (NSInteger i = 0; i < civilianArray.count; i++) {
        
        NSString *civilian = [civilianArray objectAtIndex:i];
        NSString *undercover = [undercoverArray objectAtIndex:i];
        XLWords *word = [XLWords wordWithNumber:i wordOfCivilian:civilian wordOfUndercover:undercover];
        
        [manager insertWordsItem:word];
    }

}

+ (void)creatTableNameOfwordOfFamily
{
    
    NSMutableArray *civilianArray = [[NSMutableArray alloc]initWithObjects:
                                     @"辫子", @"黑龙江",@"太白金星",@"歌星",@"浣熊",@"眼泪",@"进士",@"蚝油",@"警察",@"鸡",
                                     @"领结",@"家畜",@"蔷薇",@"馒头",@"健壮",@"环保",@"知书达理",@"黑色",@"嫌犯",@"时髦",
                                     @"茶壶",@"护工",@"蛋糕",@"东风",@"东方明珠",@"假日",@"长靴",@"斑",@"雪",@"玩笑",
                                     @"培根",@"手套",@"大葱",@"光阴似箭",@"道歉",@"星座",@"水杯",@"座机",@"门牙",@"椰子汁",
                                     @"手镯",@"冬瓜",@"娶人",@"三轮车",@"睡觉",@"海狮",@"勺子",@"草",@"一国两制",@"孩子",
                                     @"棒棒糖",@"细菌",@"半自动",@"冠军",@"马奶",@"五粮液",@"疯子",@"手电筒",@"马蜂",@"柚子",
                                     @"壁纸",@"热狗",@"核电站",@"双眼皮",@"杜甫",@"散热器",@"发卡",@"月季",@"隧道",@"爱迪生",
                                     @"福字",@"羽绒服",@"游泳",@"礼花",@"艺术体操",@"冰川",@"武状元",@"蜘蛛",@"凤凰",@"辅导机构",
                                     @"电烤箱",@"枕头",@"牛郎",@"古龙",@"保安",@"5号电池",@"面包",@"热水袋",@"奖牌",@"情侣",
                                     @"闭幕式",@"月亮",@"挖掘机",@"洋葱",@"热气球",@"贴画",@"木耳",@"玉米",@"一心一意",@"馒头",
                                     @"轮滑",@"苹果",@"表",@"黄继光",@"顺丰",@"肯德基",@"残奥会",@"医院",@"郭德纲",@"羊",
                                     @"牛肉干",@"泡泡糖",@"大饼",@"收音机",@"天安门",@"敲锣",@"恩将仇报",@"党旗",@"过年",@"老板",
                                     @"乐嘉",@"早生贵子",@"牙刷",@"日历",@"眼睛",@"紫薇",@"张飞",@"马蜂",@"电灯",@"房客",
                                     @"超人",@"北大",@"糖葫芦",@"望梅止渴",@"唱歌",@"辩论",@"暖水瓶",@"拖拉机",@"冰棍",@"魔法",
                                     @"河水",@"10010",@"潘婷",@"康师傅",@"火苗",@"项圈",@"错误",@"唐僧",@"胆结石",@"康师傅绿茶",
                                     @"独轮车",@"剪刀",@"关羽",@"青蛙",@"格格",@"新潮",@"打麻将",@"直升机",@"白蛇",@"端午节",
                                     @"花圈",@"沙发",@"药水",@"国庆",@"洗衣液",@"日光浴",@"书柜",@"演习",@"砂糖",@"五粮液",
                                     @"福娃",@"假日",@"黑发",@"回锅肉",@"橙色",@"白骨精",@"洗衣机",@"人品",@"三胞胎",@"灌汤包",
                                     @"麒麟",@"木耳",@"作曲",@"蜡像",@"白毛女",@"窗帘",@"钳子",@"轮船",@"尖椒",@"眉毛",
                                     @"棉裤",@"地铁",@"楼梯",@"睡眠",@"小学生",@"打针",@"文字",@"彪悍",@"膏药",@"公交",nil];
    
    NSMutableArray *undercoverArray = [[NSMutableArray alloc]initWithObjects:
                                       @"头发", @"哈尔滨",@"太上老君",@"影星",@"熊猫",@"鼻涕",@"举人",@"酱油",@"军人",@"鸭",
                                       @"领带",@"家禽",@"玫瑰",@"包子",@"彪悍",@"回收",@"通情达理",@"白色",@"罪犯",@"新潮",
                                       @"酒壶",@"护士",@"蛋挞",@"白板",@"埃菲尔铁塔",@"节日",@"短靴",@"痣",@"霜",@"笑话",
                                       @"火腿",@"帽子",@"大蒜",@"日月如梭",@"抱歉",@"属相",@"茶杯",@"手机",@"智齿",@"牛奶",
                                       @"手表",@"西瓜",@"嫁人",@"自行车",@"瞌睡",@"海豚",@"筷子",@"花",@"改革开放",@"子女",
                                       @"泡泡糖",@"病毒",@"全自动",@"状元",@"羊奶",@"茅台",@"傻瓜",@"探照灯",@"蜜蜂",@"橙子",
                                       @"壁画",@"汉堡",@"水电站",@"单眼皮",@"李白",@"电风扇",@"头绳",@"玫瑰",@"地道",@"爱因斯坦",
                                       @"春联",@"冲锋衣",@"潜水",@"礼炮",@"花样游泳",@"冰山",@"文状元",@"蜈蚣",@"孔雀",@"办公学校",
                                       @"微波炉",@"靠垫",@"董永",@"金庸",@"城管",@"7号电池",@"饼干",@"暖宝宝",@"奖杯",@"伴侣",
                                       @"开幕式",@"星星",@"拖拉机",@"大蒜",@"飞艇",@"壁纸",@"香菇",@"石榴",@"全心全意",@"包子",
                                       @"溜冰",@"梨子",@"钟",@"董存瑞",@"EMS",@"麦当劳",@"奥运会",@"学校",@"周立波",@"牛",
                                       @"猪肉脯",@"口香糖",@"馅饼",@"录音机",@"故宫",@"打鼓",@"忘恩负义",@"国旗",@"圣诞节",@"经理",
                                       @"孟非",@"儿孙满堂",@"鞋刷",@"月历",@"墨镜",@"小燕子",@"李逵",@"蜜蜂",@"台灯",@"房东",
                                       @"奥特曼",@"清华",@"棉花糖",@"画饼充饥",@"跳舞",@"吵架",@"保温杯",@"挖掘机",@"雪糕",@"特异功能",
                                       @"海水",@"10086",@"飘柔",@"统一",@"火花",@"项链",@"罪恶",@"法海",@"肾结石",@"统一绿茶",
                                       @"高跷",@"钳子",@"吕布",@"蟾蜍",@"公主",@"时髦",@"斗地主",@"吊扇",@"青蛇",@"圣诞节",
                                       @"花环",@"椅子",@"药丸",@"五一",@"洗衣粉",@"桑拿浴",@"衣柜",@"训练",@"白糖",@"茅台",
                                       @"海宝",@"节日",@"卷发",@"锅包肉",@"黄色",@"狐狸精",@"电冰箱",@"酒品",@"双胞胎",@"水煎包",
                                       @"龙",@"香菇",@"作词",@"石雕",@"红灯记",@"地毯",@"剪刀",@"游艇",@"红椒",@"胡须",
                                       @"秋裤",@"火车",@"电梯",@"催眠",@"小孩子",@"针灸",@"数字",@"健壮",@"创可贴",@"地铁",nil];
    
    XLWordManager *manager = [XLWordManager sharedInstance];
    manager.type = tableNameOfFamily;
    
    for (NSInteger i = 0; i < civilianArray.count; i++) {
        
        NSString *civilian = [civilianArray objectAtIndex:i];
        NSString *undercover = [undercoverArray objectAtIndex:i];
        XLWords *word = [XLWords wordWithNumber:i wordOfCivilian:civilian wordOfUndercover:undercover];
        
        [manager insertWordsItem:word];
    }
    
}

+ (void)creatTableNameOfwordOfEntertainment
{
    NSMutableArray *civilianArray = [[NSMutableArray alloc]initWithObjects:
                                         @"天后", @"阿杜", @"刘诗诗", @"百花奖", @"选秀",@"阿Sa", @"闫凤娇", @"义演",  @"王菲",  @"西城男孩",
                                         @"最佳影片", @"撞衫",@"李湘", @"韩红", @"嫩模",  @"耍大牌",  @"旁白",@"唐嫣",  @"大小恋",  @"李小璐",
                                         @"替身", @"潜规则",@"凉粉", @"票房保证", @"身价",  @"综艺大哥大",  @"师奶杀手",@"狗仔队",  @"华语榜中榜",  @"反派",
                                         @"刘嘉玲", @"谍战片",@"两栖艺人", @"情景喜剧", @"作秀",  @"萧蔷",  @"郭美美",@"戛纳电影节",  @"猫王",  @"米高梅",
                                         @"林宛瑜", @"美国达人秀",@"收视率", @"张韶涵", @"绯闻",  @"令妃",  @"经纪人",@"HipHop",  @"hold姐",  @"封杀",
                                         @"好莱坞", @"亚视",@"即兴表演", @"筷子兄弟", @"守",  @"唱而优则演",  @"DJ",@"偶像派",  @"打星",  @"舒淇",
                                         @"隐恋", @"吴宗宪",@"周星驰", @"专辑", @"亚姐",  @"主播",  @"英皇",@"福尔泰",  @"海豚音",  @"科幻电影",
                                         @"董璇", @"赵文卓",nil];
    
    
    NSMutableArray *undercoverArray = [[NSMutableArray alloc]initWithObjects:
                                          @"天王", @"杨坤",@"刘亦菲", @"金鸡奖", @"选美",  @"阿娇",  @"马诺",@"义唱",  @"那英",  @"后街男孩",
                                          @"最佳外语片", @"撞脸",@"谢娜", @"那英", @"玉女",  @"明星范",  @"对白",@"杨幂",  @"锋菲恋",  @"周迅",
                                          @"裸替", @"认干爹",@"玉米", @"票房毒药", @"片酬",  @"康熙来了",  @"少女杀手",@"娱记",  @"东方风云榜",  @"丑角",
                                          @"张曼玉", @"抗战片",@"全能艺人", @"脱口秀", @"炒作",  @"林志玲",  @"干露露",@"威尼斯电影节",  @"迈克杰克逊",  @"时代华纳",
                                          @"陈美嘉", @"美国偶像",@"票房", @"王心凌", @"八卦",  @"香妃",  @"明星助理",@"R&B",  @"凤姐",  @"雪藏",
                                          @"横店", @"无线",@"脱口秀", @"旭日阳刚", @"攻",  @"演而优则唱",  @"VJ",@"实力派",  @"脱星",  @"徐若瑄",
                                          @"隐婚", @"胡歌",@"张卫健", @"单曲", @"港姐",  @"声优",  @"滚石",@"福尔康",  @"绵羊音",  @"魔幻电影",
                                          @"佟丽娅", @"甄子丹",nil];
    XLWordManager *manager = [XLWordManager sharedInstance];
    manager.type = tableNameOfEntertainment;
    
    for (NSInteger i = 0; i < civilianArray.count; i++) {
        
        NSString *civilian = [civilianArray objectAtIndex:i];
        NSString *undercover = [undercoverArray objectAtIndex:i];
        XLWords *word = [XLWords wordWithNumber:i wordOfCivilian:civilian wordOfUndercover:undercover];
        
        [manager insertWordsItem:word];
    }


}

 */


+ (void)creatTableNameOfwordOfMyWord
{
    
    
    
    XLWordManager *manager = [XLWordManager sharedInstance];
    manager.type = tableNameOfMyWord;
    
    
        
        NSString *civilian = @"例如：鹅";
        NSString *undercover = @"例如：企鹅";
        XLWords *word = [XLWords wordWithWordOfCivilian:civilian wordOfUndercover:undercover];
        
        [manager insertWordsItem:word];
    
}

+ (NSMutableArray *)getAppointTypeArray:(NSString *)type
{
    
    
    
    if ([type isEqualToString:tableNameOfWorldCup]) {
        
        NSMutableArray *civilianArray = [[NSMutableArray alloc]initWithObjects:@"世界杯",
              @"外围传中",
              @"足球先生",
              @"抢断",
              @"球迷",
              @"护腿板",
              @"带球过人",
              @"实况足球",
              @"阿根廷",
              @"界外球",
              @"冷板凳",
              @"恒大",
              @"俱乐部",
              @"黑马",
              @"绝杀",
              @"揭幕战",
              @"人海",
              @"中场",
              @"守门员",
              @"犯规",
              @"远射",
              @"防守反击",
              @"下课",
              @"角球",
              @"黄牌",
              @"毽球",
              @"手球",
              @"意甲",
              @"裁判员",
              @"二过一",
              @"禁区",
              @"长传",
              @"球票",
              @"幸运星",
              @"后卫",
              @"倒钩球",
              @"马拉多纳",
              @"AC米兰",
              @"球门",
              @"点球",
              nil];
        
        NSMutableArray *undercoverArray = [[NSMutableArray alloc]initWithObjects:@"欧洲杯",
                                           @"下底传中",
                                           @"最佳球员",
                                           @"铲球",
                                           @"拉拉队",
                                           @"护膝",
                                           @"合理冲撞",
                                           @"FIFA足球",
                                           @"巴西",
                                           @"角球",
                                           @"替补",
                                           @"国安",
                                           @"国家队",
                                           @"冷门",
                                           @"翻盘",
                                           @"开幕式",
                                           @"人墙",
                                           @"前锋",
                                           @"守卫",
                                           @"越位",
                                           @"吊射",
                                           @"全攻全守",
                                           @"退役",
                                           @"点球",
                                           @"红牌",
                                           @"蹴鞠",
                                           @"头球",
                                           @"德甲",
                                           @"巡边员",
                                           @"人球分过",
                                           @"边线",
                                           @"直塞",
                                           @"球衣",
                                           @"吉祥物",
                                           @"后腰",
                                           @"香蕉球",
                                           @"贝利",
                                           @"国际米兰",
                                           @"球网",
                                           @"任意球",
                                           nil];

        NSMutableArray *array = [NSMutableArray array];
        for (NSInteger i = 0; i < civilianArray.count; i++) {
            
            NSString *civilian = [civilianArray objectAtIndex:i];
            NSString *undercover = [undercoverArray objectAtIndex:i];
            XLWords *word = [XLWords wordWithWordOfCivilian:civilian wordOfUndercover:undercover];
            [array addObject:word];
            
         }

        return array ;
        
    }
    if ([type isEqualToString:tableNameOfEntertainment]) {
        
        NSMutableArray *civilianArray = [[NSMutableArray alloc]initWithObjects:
                                         @"天后", @"阿杜", @"刘诗诗", @"百花奖", @"选秀",@"阿Sa", @"闫凤娇", @"义演",  @"王菲",  @"西城男孩",
                                         @"最佳影片", @"撞衫",@"李湘", @"韩红", @"嫩模",  @"耍大牌",  @"旁白",@"唐嫣",  @"大小恋",  @"李小璐",
                                         @"替身", @"潜规则",@"凉粉", @"票房保证", @"身价",  @"综艺大哥大",  @"师奶杀手",@"狗仔队",  @"华语榜中榜",  @"反派",
                                         @"刘嘉玲", @"谍战片",@"两栖艺人", @"情景喜剧", @"作秀",  @"萧蔷",  @"郭美美",@"戛纳电影节",  @"猫王",  @"米高梅",
                                         @"林宛瑜", @"美国达人秀",@"收视率", @"张韶涵", @"绯闻",  @"令妃",  @"经纪人",@"HipHop",  @"hold姐",  @"封杀",
                                         @"好莱坞", @"亚视",@"即兴表演", @"筷子兄弟", @"守",  @"唱而优则演",  @"DJ",@"偶像派",  @"打星",  @"舒淇",
                                         @"隐恋", @"吴宗宪",@"周星驰", @"专辑", @"亚姐",  @"主播",  @"英皇",@"福尔泰",  @"海豚音",  @"科幻电影",
                                         @"董璇", @"赵文卓",nil];
        
        
        NSMutableArray *undercoverArray = [[NSMutableArray alloc]initWithObjects:
                                           @"天王", @"杨坤",@"刘亦菲", @"金鸡奖", @"选美",  @"阿娇",  @"马诺",@"义唱",  @"那英",  @"后街男孩",
                                           @"最佳外语片", @"撞脸",@"谢娜", @"那英", @"玉女",  @"明星范",  @"对白",@"杨幂",  @"锋菲恋",  @"周迅",
                                           @"裸替", @"认干爹",@"玉米", @"票房毒药", @"片酬",  @"康熙来了",  @"少女杀手",@"娱记",  @"东方风云榜",  @"丑角",
                                           @"张曼玉", @"抗战片",@"全能艺人", @"脱口秀", @"炒作",  @"林志玲",  @"干露露",@"威尼斯电影节",  @"迈克杰克逊",  @"时代华纳",
                                           @"陈美嘉", @"美国偶像",@"票房", @"王心凌", @"八卦",  @"香妃",  @"明星助理",@"R&B",  @"凤姐",  @"雪藏",
                                           @"横店", @"无线",@"脱口秀", @"旭日阳刚", @"攻",  @"演而优则唱",  @"VJ",@"实力派",  @"脱星",  @"徐若瑄",
                                           @"隐婚", @"胡歌",@"张卫健", @"单曲", @"港姐",  @"声优",  @"滚石",@"福尔康",  @"绵羊音",  @"魔幻电影",
                                           @"佟丽娅", @"甄子丹",nil];

        NSMutableArray *array = [NSMutableArray array];
        for (NSInteger i = 0; i < civilianArray.count; i++) {
            
            NSString *civilian = [civilianArray objectAtIndex:i];
            NSString *undercover = [undercoverArray objectAtIndex:i];
            XLWords *word = [XLWords wordWithWordOfCivilian:civilian wordOfUndercover:undercover];
            
            [array addObject:word];
        }
        return array ;

    }
    if ([type isEqualToString:tableNameOfFamily]) {
        NSMutableArray *civilianArray = [[NSMutableArray alloc]initWithObjects:
                                         @"辫子", @"黑龙江",@"太白金星",@"歌星",@"浣熊",@"眼泪",@"进士",@"蚝油",@"警察",@"鸡",
                                         @"领结",@"家畜",@"蔷薇",@"馒头",@"健壮",@"环保",@"知书达理",@"黑色",@"嫌犯",@"时髦",
                                         @"茶壶",@"护工",@"蛋糕",@"东风",@"东方明珠",@"假日",@"长靴",@"斑",@"雪",@"玩笑",
                                         @"培根",@"手套",@"大葱",@"光阴似箭",@"道歉",@"星座",@"水杯",@"座机",@"门牙",@"椰子汁",
                                         @"手镯",@"冬瓜",@"娶人",@"三轮车",@"睡觉",@"海狮",@"勺子",@"草",@"一国两制",@"孩子",
                                         @"棒棒糖",@"细菌",@"半自动",@"冠军",@"马奶",@"五粮液",@"疯子",@"手电筒",@"马蜂",@"柚子",
                                         @"壁纸",@"热狗",@"核电站",@"双眼皮",@"杜甫",@"散热器",@"发卡",@"月季",@"隧道",@"爱迪生",
                                         @"福字",@"羽绒服",@"游泳",@"礼花",@"艺术体操",@"冰川",@"武状元",@"蜘蛛",@"凤凰",@"辅导机构",
                                         @"电烤箱",@"枕头",@"牛郎",@"古龙",@"保安",@"5号电池",@"面包",@"热水袋",@"奖牌",@"情侣",
                                         @"闭幕式",@"月亮",@"挖掘机",@"洋葱",@"热气球",@"贴画",@"木耳",@"玉米",@"一心一意",@"馒头",
                                         @"轮滑",@"苹果",@"表",@"黄继光",@"顺丰",@"肯德基",@"残奥会",@"医院",@"郭德纲",@"羊",
                                         @"牛肉干",@"泡泡糖",@"大饼",@"收音机",@"天安门",@"敲锣",@"恩将仇报",@"党旗",@"过年",@"老板",
                                         @"乐嘉",@"早生贵子",@"牙刷",@"日历",@"眼睛",@"紫薇",@"张飞",@"马蜂",@"电灯",@"房客",
                                         @"超人",@"北大",@"糖葫芦",@"望梅止渴",@"唱歌",@"辩论",@"暖水瓶",@"拖拉机",@"冰棍",@"魔法",
                                         @"河水",@"10010",@"潘婷",@"康师傅",@"火苗",@"项圈",@"错误",@"唐僧",@"胆结石",@"康师傅绿茶",
                                         @"独轮车",@"剪刀",@"关羽",@"青蛙",@"格格",@"新潮",@"打麻将",@"直升机",@"白蛇",@"端午节",
                                         @"花圈",@"沙发",@"药水",@"国庆",@"洗衣液",@"日光浴",@"书柜",@"演习",@"砂糖",@"五粮液",
                                         @"福娃",@"假日",@"黑发",@"回锅肉",@"橙色",@"白骨精",@"洗衣机",@"人品",@"三胞胎",@"灌汤包",
                                         @"麒麟",@"木耳",@"作曲",@"蜡像",@"白毛女",@"窗帘",@"钳子",@"轮船",@"尖椒",@"眉毛",
                                         @"棉裤",@"地铁",@"楼梯",@"睡眠",@"小学生",@"打针",@"文字",@"彪悍",@"膏药",@"公交",nil];
        
        NSMutableArray *undercoverArray = [[NSMutableArray alloc]initWithObjects:
                                           @"头发", @"哈尔滨",@"太上老君",@"影星",@"熊猫",@"鼻涕",@"举人",@"酱油",@"军人",@"鸭",
                                           @"领带",@"家禽",@"玫瑰",@"包子",@"彪悍",@"回收",@"通情达理",@"白色",@"罪犯",@"新潮",
                                           @"酒壶",@"护士",@"蛋挞",@"白板",@"埃菲尔铁塔",@"节日",@"短靴",@"痣",@"霜",@"笑话",
                                           @"火腿",@"帽子",@"大蒜",@"日月如梭",@"抱歉",@"属相",@"茶杯",@"手机",@"智齿",@"牛奶",
                                           @"手表",@"西瓜",@"嫁人",@"自行车",@"瞌睡",@"海豚",@"筷子",@"花",@"改革开放",@"子女",
                                           @"泡泡糖",@"病毒",@"全自动",@"状元",@"羊奶",@"茅台",@"傻瓜",@"探照灯",@"蜜蜂",@"橙子",
                                           @"壁画",@"汉堡",@"水电站",@"单眼皮",@"李白",@"电风扇",@"头绳",@"玫瑰",@"地道",@"爱因斯坦",
                                           @"春联",@"冲锋衣",@"潜水",@"礼炮",@"花样游泳",@"冰山",@"文状元",@"蜈蚣",@"孔雀",@"办公学校",
                                           @"微波炉",@"靠垫",@"董永",@"金庸",@"城管",@"7号电池",@"饼干",@"暖宝宝",@"奖杯",@"伴侣",
                                           @"开幕式",@"星星",@"拖拉机",@"大蒜",@"飞艇",@"壁纸",@"香菇",@"石榴",@"全心全意",@"包子",
                                           @"溜冰",@"梨子",@"钟",@"董存瑞",@"EMS",@"麦当劳",@"奥运会",@"学校",@"周立波",@"牛",
                                           @"猪肉脯",@"口香糖",@"馅饼",@"录音机",@"故宫",@"打鼓",@"忘恩负义",@"国旗",@"圣诞节",@"经理",
                                           @"孟非",@"儿孙满堂",@"鞋刷",@"月历",@"墨镜",@"小燕子",@"李逵",@"蜜蜂",@"台灯",@"房东",
                                           @"奥特曼",@"清华",@"棉花糖",@"画饼充饥",@"跳舞",@"吵架",@"保温杯",@"挖掘机",@"雪糕",@"特异功能",
                                           @"海水",@"10086",@"飘柔",@"统一",@"火花",@"项链",@"罪恶",@"法海",@"肾结石",@"统一绿茶",
                                           @"高跷",@"钳子",@"吕布",@"蟾蜍",@"公主",@"时髦",@"斗地主",@"吊扇",@"青蛇",@"圣诞节",
                                           @"花环",@"椅子",@"药丸",@"五一",@"洗衣粉",@"桑拿浴",@"衣柜",@"训练",@"白糖",@"茅台",
                                           @"海宝",@"节日",@"卷发",@"锅包肉",@"黄色",@"狐狸精",@"电冰箱",@"酒品",@"双胞胎",@"水煎包",
                                           @"龙",@"香菇",@"作词",@"石雕",@"红灯记",@"地毯",@"剪刀",@"游艇",@"红椒",@"胡须",
                                           @"秋裤",@"火车",@"电梯",@"催眠",@"小孩子",@"针灸",@"数字",@"健壮",@"创可贴",@"地铁",nil];
        NSMutableArray *array = [NSMutableArray array];
        for (NSInteger i = 0; i < civilianArray.count; i++) {
            
            NSString *civilian = [civilianArray objectAtIndex:i];
            NSString *undercover = [undercoverArray objectAtIndex:i];
            XLWords *word = [XLWords wordWithWordOfCivilian:civilian wordOfUndercover:undercover];
            
            [array addObject:word];
        }
        return array;

    }
    if ([type isEqualToString:tableNameOfSchoolyard]) {
        NSMutableArray *civilianArray = [[NSMutableArray alloc]initWithObjects:
                                         @"脚踝" ,@"麻辣烫" ,@"防弹衣" ,@"宵夜" ,@"作家" ,@"放屁" ,@"凯旋门" ,@"高考" ,@"矮人" ,@"紫菜" ,
                                         @"奶茶" ,@"韩寒" ,@"生气" ,@"毕业" ,@"班主任" ,@"过山车" ,@"土豆粉" ,@"小笼包" ,@"泡泡糖" ,@"酸菜鱼" ,
                                         @"男朋友" ,@"口香糖" ,@"蝙蝠侠" ,@"图书馆" ,@"公交" ,@"剩女" ,@"洗衣粉" ,@"鱼香肉丝" ,@"奖牌" ,@"作文" ,
                                         @"抱枕" ,@"状元" ,@"饺子" ,@"高跟鞋" ,@"端午节" ,@"小矮人" ,@"蜘蛛侠" ,@"金庸" ,@"海豚" ,@"森马" ,
                                         @"唇膏" ,@"烤肉" ,@"纸巾" ,@"白菜" ,@"芥末" ,@"话剧" ,@"琵琶" ,@"神话" ,@"捕快" ,@"零花钱" ,
                                         @"扩音器" ,@"洗发水" ,@"自行车" ,@"福尔摩斯" ,@"美剧" ,@"流星花园" ,@"面包" ,@"同学" ,@"老佛爷" ,@"情人节" ,
                                         @"隐形眼镜" ,@"麻花" ,@"龙凤胎" ,@"魔法师" ,@"鲜橙多" ,@"豆浆" ,@"何炅" ,@"若曦" ,@"四爷" ,@"玫瑰花" ,
                                         @"操场" ,@"校花" ,@"胖子" ,@"眉毛" ,@"谢娜" ,@"水盆" ,@"香港" ,@"橙子" ,@"牛肉干" ,@"包青天" ,
                                         @"甄子丹" ,@"铁观音" ,@"十面埋伏" ,@"神雕侠侣" ,@"保镖" ,@"粉条" ,@"牛头" ,@"皇冠" ,@"蟾蜍" ,@"晴天霹雳" ,
                                         @"皮蛋豆腐" ,@"出类拔萃" ,@"宋小宝" ,@"金丝猴" ,@"天天向上" ,@"勇往直前" ,@"美人心计" ,@"鼠目寸光" ,@"语无伦次" ,@"刘诗诗" ,
                                         @"狼人" ,@"济公" ,@"花木兰" ,@"首尔" ,@"龙争虎斗" ,@"窗帘" ,@"狮子" ,@"西红柿" ,@"东方不败" ,@"中药" ,
                                         @"牛仔裤" ,@"钢笔" ,@"太阳" ,@"风衣" ,@"安卓" ,@"沉鱼落雁" ,@"直升飞机" ,@"美丽" ,@"推土机" ,@"新华字典" ,
                                         @"小红帽" ,@"恋人" ,@"日光" ,@"猩猩" ,nil];
        
        
        NSMutableArray *undercoverArray = [[NSMutableArray alloc]initWithObjects:
                                           @"膝盖" ,@"火锅" ,@"盔甲" ,@"烧烤" ,@"编剧" ,@"打嗝" ,@"埃菲尔铁塔" ,@"中考" ,@"侏儒" ,@"海苔" ,
                                           @"奶昔" ,@"郭敬明" ,@"愤怒" ,@"放假" ,@"辅导员" ,@"碰碰车" ,@"酸辣粉" ,@"灌汤包" ,@"棒棒糖" ,@"水煮鱼" ,
                                           @"前男友" ,@"木糖醇" ,@"蜘蛛侠" ,@"图书店" ,@"地铁" ,@"御姐" ,@"皂角粉" ,@"宫保鸡丁" ,@"金牌" ,@"论文" ,
                                           @"枕头" ,@"冠军" ,@"包子" ,@"增高鞋" ,@"中秋节" ,@"葫芦娃" ,@"蜘蛛精" ,@"古龙" ,@"海狮" ,@"以纯" ,
                                           @"口红" ,@"涮肉" ,@"手帕" ,@"生菜" ,@"辣椒" ,@"小品" ,@"吉他" ,@"童话" ,@"警察" ,@"生活费" ,
                                           @"麦克风" ,@"沐浴露" ,@"电动车" ,@"侦探柯南" ,@"韩剧" ,@"花样男子" ,@"蛋糕" ,@"同桌" ,@"老天爷" ,@"光棍节" ,
                                           @"近视眼镜" ,@"油条" ,@"双胞胎" ,@"魔术师" ,@"果粒多" ,@"牛奶" ,@"张杰" ,@"晴川" ,@"八爷" ,@"月季花" ,
                                           @"礼堂" ,@"美女" ,@"肥肉" ,@"胡须" ,@"李湘" ,@"水桶" ,@"台湾" ,@"橘子" ,@"猪肉脯" ,@"狄仁杰" ,
                                           @"李连杰" ,@"碧螺春" ,@"四面楚歌" ,@"天龙八部" ,@"保安" ,@"粉丝" ,@"马面" ,@"后冠" ,@"青蛙" ,@"万里无云" ,
                                           @"麻婆豆腐" ,@"鹤立鸡群" ,@"小沈阳" ,@"大白兔" ,@"非诚勿扰" ,@"全力以赴" ,@"倾世皇妃" ,@"井底之蛙" ,@"语意不清" ,@"吴奇隆" ,
                                           @"吸血鬼" ,@"法海" ,@"祝英台" ,@"东京" ,@"龙腾虎跃" ,@"床单" ,@"老虎" ,@"番茄" ,@"天山童姥" ,@"咖啡" ,
                                           @"打底裤" ,@"铅笔" ,@"月亮" ,@"毛衣" ,@"苹果" ,@"闭月羞花" ,@"喷气飞机" ,@"魅力" ,@"挖土机" ,@"英汉字典" ,
                                           @"绿帽子" ,@"情人" ,@"灯光" ,@"猴子",nil];
        NSMutableArray *array = [NSMutableArray array];
        for (NSInteger i = 0; i < civilianArray.count; i++) {
            
            NSString *civilian = [civilianArray objectAtIndex:i];
            NSString *undercover = [undercoverArray objectAtIndex:i];
            XLWords *word = [XLWords wordWithWordOfCivilian:civilian wordOfUndercover:undercover];
            
            [array addObject:word];
        }
        return array;


    }
    if ([type isEqualToString:tableNameOfFriend]) {
        NSMutableArray *civilianArray = [[NSMutableArray alloc]initWithObjects:
                                         @"手机膜",@"火锅",@"铠甲",@"XBox",@"指甲油", @"游艇",@"黑猫警长",@"演员",@"街舞",@"僵尸",
                                         @"选美冠军",@"班主任",@"节操",@"古力娜扎",@"装纯", @"塑身",@"神仙",@"恍然大悟",@"图片",@"香港",
                                         @"暂停",@"WORD",@"魔鬼",@"正方形",@"平底鞋", @"弱智",@"绿箭",@"找你妹",@"基佬",@"手提包",
                                         @"科比",@"精神病",@"模仿",@"激情",@"商人", @"放屁",@"美容",@"酷我音乐",@"董事长",@"方片",
                                         @"奇葩",@"双色球",@"苦思冥想",@"湖南卫视",@"貂蝉", @"水煮鱼",@"防弹衣",@"竹子",@"难民",@"愤怒",
                                         @"牙科医生",@"任意门",@"MP4",@"桌球",@"鸭脖", @"一言不发",@"举案齐眉",@"打鼓",@"苹果",@"政党",
                                         @"面条",@"小笼包",@"发票",@"专家",@"非主流", @"平壤",@"冥思",@"间谍",@"宝石",@"白痴",
                                         @"汪涵",@"徘徊",@"幽灵",@"新郎",@"新年快乐", @"望远镜",@"好玩",@"罗贯中",@"王语嫣",@"哇塞",
                                         @"交通部",@"基友",@"刘亦菲",@"迪奥",@"轿车", @"经理",@"麦霸",@"壁纸",@"凤凰",@"纯净水",
                                         @"篮球鞋",@"收据",@"乌龟",@"朋友",@"会员", @"泡泡糖",@"逆袭",@"甜心",@"土豆网",@"奖金",
                                         @"工商银行",@"尿道",@"油漆",@"出纳",@"道观", @"LED",@"眼睛",@"翔",@"鳄鱼",@"牵手",
                                         @"擒拿术",@"奸细",@"洗面奶",@"姚明",@"摇椅",@"狄仁杰",@"手机",@"咖啡",@"海角",@"911",
                                         @"影后",@"比基尼",@"一面之缘",@"客机",@"自杀", @"线人",@"宅女",@"夫人",@"宙斯",@"大舅妈",
                                         @"Adidas",@"杠铃",@"托福",@"青春痘",@"王老吉", @"保安",@"吃醋",@"便当",@"收据",@"含笑半步癫",
                                         @"眉毛",@"丝瓜",@"胖子",@"平底鞋",@"凤姐", @"周杰伦",@"视频",@"失恋",@"冷艳",@"横死街头",
                                         @"火影",@"本拉登",@"客机",@"腋毛",@"情人节",@"朱雀",@"监视器",@"信乐团",@"排球场",@"腾讯QQ",
                                         @"匹诺曹",@"银行",@"广岛",@"复制",@"沙县小吃", @"奶昔",@"红颜知己",@"脸盆",@"药片",@"乌拉圭",
                                         @"年糕",@"汉奸",@"猴子",@"紫菜",@"海鸥",@"地主",@"伏特加",@"蜜月",@"大张伟",@"空前绝后",
                                         @"卡巴斯基",@"入口",@"草花",@"胡海泉",@"麻花", @"醉酒驾车",@"和尚",@"接吻",@"惊悚片",@"抱枕",
                                         @"烧烤",@"侏儒",@"金正恩",@"足不出户",@"鼠标", @"诸葛亮",nil];
        
        
        
        
        
        
        
        NSMutableArray *undercoverArray = [[NSMutableArray alloc]initWithObjects:
                                           @"手机壳",@"烧烤",@"盾牌",@"Wii",@"美甲师", @"游轮",@"包公",@"歌手",@"跳舞",@"吸血鬼",
                                           @"世界小姐",@"辅导员",@"情操",@"佟丽娅",@"装逼", @"减肥",@"魔鬼",@"茅塞顿开",@"视频",@"澳门",
                                           @"静止",@"PPT",@"天使",@"菱形",@"高跟鞋", @"幼稚",@"益达",@"连连看",@"直男",@"挎包",
                                           @"乔丹",@"神经病",@"抄袭",@"基情",@"老板", @"打嗝",@"美甲",@"酷狗音乐",@"总经理",@"红桃",
                                           @"屌丝",@"大乐透",@"绞尽脑汁",@"CCTV",@"王昭君", @"酸菜鱼",@"盔甲",@"甘蔗",@"屌丝",@"生气",
                                           @"口腔医生",@"时光机",@"MP3",@"乒乓球",@"鸡爪", @"言多必失",@"相濡以沫",@"敲锣",@"芒果",@"宗教",
                                           @"米粉",@"灌汤包",@"支票",@"教授",@"杀马特", @"首尔",@"沉思",@"黑客",@"珍珠",@"傻子",
                                           @"何炅",@"等待",@"僵尸",@"新娘",@"圣诞快乐", @"瞄准镜",@"可笑",@"施耐庵",@"小龙女",@"我靠",
                                           @"铁道部",@"损友",@"伊能静",@"香奈儿",@"卡车", @"老板",@"K歌之王",@"贴画",@"孔雀",@"矿泉水",
                                           @"足球鞋",@"发票",@"甲鱼",@"同学",@"成员", @"口香糖",@"逆天",@"宝贝",@"优酷网",@"福利",
                                           @"建设银行",@"水管",@"涂料",@"会计",@"寺庙", @"LCD",@"放大镜",@"屎",@"鲨鱼",@"握手",
                                           @"防狼术",@"间谍",@"爽肤水",@"林书豪",@"摇篮", @"包青天",@"相机",@"可可",@"天涯",@"110",
                                           @"影帝",@"丁字裤",@"萍水相逢",@"战斗机",@"自残", @"卧底",@"宅男",@"太太",@"阿瑞斯",@"大姨妈",
                                           @"Nike",@"哑铃",@"雅思",@"美人痣",@"加多宝",@"警察",@"嫉妒",@"快餐",@"发票",@"一日丧命散",
                                           @"胡须",@"黄瓜",@"吃货",@"高跟鞋",@"犀利哥", @"林俊杰",@"图片",@"离婚",@"高傲",@"死于非命",
                                           @"雷影",@"塔利班",@"战斗机",@"胸毛",@"光棍节", @"凤凰",@"摄像头",@"五月天",@"篮球场",@"YY语音",
                                           @"小红帽",@"钱柜",@"长崎",@"剪切",@"兰州拉面", @"奶茶",@"蓝颜知己",@"脚盆",@"胶囊",@"巴拉圭",
                                           @"寿司",@"卧底",@"拂拂",@"海苔",@"海燕",@"房东",@"威士忌",@"新婚",@"陈志朋",@"断子绝孙",
                                           @"金山毒霸",@"出口",@"黑桃",@"陈羽凡",@"油条", @"酒后驾车",@"光头",@"初吻",@"恐怖片",@"枕头",
                                           @"夜宵",@"矮人",@"金正日",@"闭门思过",@"键盘",@"周瑜",nil];
        NSMutableArray *array = [NSMutableArray array];
        for (NSInteger i = 0; i < civilianArray.count; i++) {
            
            NSString *civilian = [civilianArray objectAtIndex:i];
            NSString *undercover = [undercoverArray objectAtIndex:i];
            XLWords *word = [XLWords wordWithWordOfCivilian:civilian wordOfUndercover:undercover];
            
            [array addObject:word];
        }
        return array;


    }
    if ([type isEqualToString:tableNameOfPartysu]) {
        
        NSMutableArray *civilianArray = [NSMutableArray arrayWithObjects:
            @"擎天柱",@"金钟罩",@"波斯猫",@"梨子",@"放大镜",@"侄子",@"外公",@"星座",@"食人族",@"千足金",
            @"烟斗",@"醋",@"唐伯虎",@"餐厅",@"热水器",@"雪",@"隐形眼镜",@"辛弃疾",@"微信",@"茶叶",
            @"崇拜",@"眼线液",@"丰田",@"腐女",@"会计",@"警察",@"围脖",@"我去",@"门卫",@"处女座",
            @"奶牛",@"错误",@"化学",@"德芙",@"树莓",@"头发",@"花样游泳",@"奖金",@"姨妈",@"教授",
          @"房客",@"武林外传",@"初中",@"口若悬河",@"丞相",@"花盆",@"武汉",@"长江",@"金嗓子",@"小兴安岭",
          @"百度",@"煤矿",@"侦探小说",@"快速",@"圣诞节",@"神经病",@"袜子",@"大饼",@"王维",@"青蛙",
          @"高压锅",@"分手",@"眉目传情",@"武藤兰",@"古筝",@"仙人掌",@"非诚勿扰",@"宝马",@"喜欢",@"伊朗",
          @"领结",@"五月天",@"太平洋",@"手镯",@"流星",@"丁字裤",@"收音机",@"汤圆",@"法拉利",@"卫生纸",
        @"沉思",@"汉武帝",@"蝴蝶",@"凉鞋",@"大白兔",@"撒泼",@"眉毛",@"痴汉",@"小说",@"摄像机",
        @"股票",@"梳头",@"西施",@"妙语连珠",@"树懒",@"冥王星",@"阿迪达斯",@"火柴",@"尿道",@"滑冰",nil];
        
        
        NSMutableArray *undercoverArray = [NSMutableArray arrayWithObjects:
      @"大黄蜂",@"铁布衫",@"加菲猫",@"苹果",@"老花镜",@"儿子",@"爷爷",@"生肖",@"食人鱼",@"铂金",
     @"香烟",@"酱油",@"韦小宝",@"厨房",@"热的块",@"霜",@"近视眼镜",@"苏东坡",@"QQ",@"咖啡",
       @"敬仰",@"眼线笔",@"本田",@"宅女",@"出纳",@"武警",@"红领巾",@"我靠",@"保安",@"水瓶座",
        @"水牛",@"罪恶",@"物理",@"费列罗",@"桑果",@"辫子",@"艺术体操",@"年金",@"舅妈",@"专家",
      @"房东",@"笑傲江湖",@"高中",@"信口雌黄",@"将军",@"花瓶",@"合肥",@"黄河",@"西瓜霜",@"大兴安岭",
      @"谷歌",@"油矿",@"推理小说",@"快速",@"过年",@"精神病",@"鞋子",@"馅饼",@"李白",@"牛蛙",
       @"电饭煲",@"被甩",@"暗送秋波",@"苍井空",@"扬琴",@"仙人球",@"我们约会吧",@"奔驰",@"爱",@"伊拉克",
      @"领带",@"信乐团",@"大西洋",@"手表",@"彗星",@"三角裤",@"录音机",@"元宵",@"保时捷",@"餐巾纸",
       @"冥想",@"秦始皇",@"蜜蜂",@"拖鞋",@"金丝猴",@"撒娇",@"睫毛",@"痴女",@"作文",@"照相机",
       @"彩票",@"理发",@"貂蝉",@"口若悬河",@"考拉",@"海王星",@"耐克",@"打火机",@"水管",@"滑雪",nil];
        
        NSMutableArray *array = [NSMutableArray array];
        for (NSInteger i = 0; i < civilianArray.count; i++) {
            
            NSString *civilian = [civilianArray objectAtIndex:i];
            NSString *undercover = [undercoverArray objectAtIndex:i];
            XLWords *word = [XLWords wordWithWordOfCivilian:civilian wordOfUndercover:undercover];
            
            [array addObject:word];
        }
        return array;

    }
    
    
    
    
    return nil;
    
}




@end
